In [17]:
import pandas as pd
import numpy as np

In [22]:
joany_df = pd.read_csv("./data/tabula-Joany - Data Engineer Test - aeta_sample_p1-Copy1.csv",
                      sep=",")

In [23]:
joany_df.shape

(17, 11)

In [24]:
joany_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 11 columns):
Rating Area:CARA01 *    17 non-null object
Unnamed: 1              16 non-null object
Unnamed: 2              0 non-null float64
Unnamed: 3              0 non-null float64
Unnamed: 4              16 non-null object
Unnamed: 5              16 non-null object
Unnamed: 6              0 non-null float64
Unnamed: 7              0 non-null float64
Unnamed: 8              16 non-null object
Unnamed: 9              16 non-null object
Unnamed: 10             0 non-null float64
dtypes: float64(5), object(6)
memory usage: 1.5+ KB

In [25]:
joany_df

,Rating Area:CARA01 *,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,Plan ID:14033847Plan Name:CA Silver Indemnity ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Age,Rate,NaN,NaN,Age,Rate,NaN,NaN,Age,Rate,NaN
2,0-20,421.26,NaN,NaN,35,810.67,NaN,NaN,50,1184.82,NaN
3,21,663.39,NaN,NaN,36,815.98,NaN,NaN,51,1237.23,NaN
4,22,663.39,NaN,NaN,37,821.28,NaN,NaN,52,1294.95,NaN
5,23,663.39,NaN,NaN,38,826.59,NaN,NaN,53,1353.33,NaN
6,24,663.39,NaN,NaN,39,837.20,NaN,NaN,54,1416.35,NaN
7,25,666.05,NaN,NaN,40,847.82,NaN,NaN,55,1479.37,NaN
8,26,679.32,NaN,NaN,41,863.74,NaN,NaN,56,1547.70,NaN
9,27,695.24,NaN,NaN,42,879.00,NaN,NaN,57,1616.69,NaN
10,28,721.11,NaN,NaN,43,900.23,NaN,NaN,58,1690.33,NaN
11,29,742.34,NaN,NaN,44,926.76,NaN,NaN,59,1726.82,NaN
12,30,752.95,NaN,NaN,45,957.94,NaN,NaN,60,1800.45,NaN
13,31,768.87,NaN,NaN,46,995.09,NaN,NaN,61,1864.14,NaN
14,32,784.80,NaN,NaN,47,1036.89,NaN,NaN,62,1905.93,NaN
15,33,794.75,NaN,NaN,48,1084.65,NaN,NaN,63,1958.34,NaN
16,34,805.36,NaN,NaN,49,1131.75,NaN,NaN,64+,1989.52,NaN

In [27]:
joany_df.columns

Index(['Rating Area:CARA01 *', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3',
       'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8',
       'Unnamed: 9', 'Unnamed: 10'],
      dtype='object')

In [28]:
to_drop= ['Unnamed: 2','Unnamed: 3','Unnamed: 6','Unnamed: 7','Unnamed: 10']

In [31]:
joany_df = joany_df.drop(to_drop, axis=1)

In [32]:
joany_df

,Rating Area:CARA01 *,Unnamed: 1,Unnamed: 4,Unnamed: 5,Unnamed: 8,Unnamed: 9
0,Plan ID:14033847Plan Name:CA Silver Indemnity ...,NaN,NaN,NaN,NaN,NaN
1,Age,Rate,Age,Rate,Age,Rate
2,0-20,421.26,35,810.67,50,1184.82
3,21,663.39,36,815.98,51,1237.23
4,22,663.39,37,821.28,52,1294.95
5,23,663.39,38,826.59,53,1353.33
6,24,663.39,39,837.20,54,1416.35
7,25,666.05,40,847.82,55,1479.37
8,26,679.32,41,863.74,56,1547.70
9,27,695.24,42,879.00,57,1616.69
10,28,721.11,43,900.23,58,1690.33
11,29,742.34,44,926.76,59,1726.82
12,30,752.95,45,957.94,60,1800.45
13,31,768.87,46,995.09,61,1864.14
14,32,784.80,47,1036.89,62,1905.93
15,33,794.75,48,1084.65,63,1958.34
16,34,805.36,49,1131.75,64+,1989.52

In [33]:
joany_df.columns = joany_df.iloc[1]

In [64]:
joany_df2 = joany_df.iloc[2:17,2:4]

In [67]:
joany_df1= joany_df.iloc[2:17,0:2]

In [61]:
joany_df3 =joany_df.iloc[2:17,4:6]

In [89]:
joany_df1.head(2)

1   Age    Rate
2  0-20  421.26
3    21  663.39

In [90]:
joany_df2.head(2)

1 Age    Rate
2  35  810.67
3  36  815.98

In [91]:
joany_df3.head(2)

1 Age     Rate
2  50  1184.82
3  51  1237.23

In [79]:
all_df = pd.concat([joany_df1,joany_df2,joany_df3],axis=0,ignore_index=True)

In [80]:
all_df["plan_ID"] = int(14033847)

In [81]:
all_df["plan_name"] = "CA Silver Indemnity 1500 80"

In [82]:
all_df["region_number"] = "CARA01"

In [83]:
all_df["issuer_name"] = "Aetna"

In [85]:
all_df.rename(columns={'Age': 'age', 'Rate': 'price'}, inplace=True)

In [86]:
all_df.head()

1,age,price,plan_ID,plan_name,region_number,issuer_name
0,0-20,421.26,14033847,CA Silver Indemnity 1500 80,CARA01,Aetna
1,21,663.39,14033847,CA Silver Indemnity 1500 80,CARA01,Aetna
2,22,663.39,14033847,CA Silver Indemnity 1500 80,CARA01,Aetna
3,23,663.39,14033847,CA Silver Indemnity 1500 80,CARA01,Aetna
4,24,663.39,14033847,CA Silver Indemnity 1500 80,CARA01,Aetna

In [87]:
all_df.to_csv("joany_python.csv")